<a href="https://colab.research.google.com/github/TurgutOzkan/DataSciencity/blob/master/How_to_Query_SQLite_Database_on_Google_Colab%3F.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In this brief post, we will discuss how to create databases and use them within Colab. You can find a previous [post](https://datasciencity.com/2019/12/31/how-to-use-google-colab/) on how to use Colab. [SQlite](https://www.sqlite.org/index.html) is already installed in Colab. In this post, we will create a database and in later ones, we will work on some queries. We will use the data generated [here](https://en.wikibooks.org/wiki/SQL_Exercises/Employee_management).

In [ ]:
# CREATING THE TABLE
import sqlite3

conn = sqlite3.connect('test.db')

conn.execute('''
CREATE TABLE Departments (
   Code INTEGER PRIMARY KEY NOT NULL,
   Name NVARCHAR NOT NULL ,
   Budget REAL NOT NULL 
 );''')

conn.commit()

print("Departments table created");

conn.execute('''
CREATE TABLE Employees (
   SSN INTEGER PRIMARY KEY NOT NULL,
   Name TEXT NOT NULL ,
   LastName VARCHAR NOT NULL ,--since question 2 asks about removing duplicate - text must be converted if the answer is using distinct
   Department INTEGER NOT NULL , 
   CONSTRAINT fk_Departments_Code FOREIGN KEY(Department) 
   REFERENCES Departments(Code)
 );''')

conn.commit()

print("Employees table created");

Departments table created
Employees table created

We created our tables. This code also created files. See the folder icon on the left and click on it. You will see we that we created a database there. If you rerun above, you will get error saying that the table is already created. If you experienced a typo etc. somewhere and want to rerun everything for some reason, you need to factory reset from 'Runtime' menu above. That will erase the files created. So you can fix your code and hit the run, then you will see the files created with the '....table created' message.

We still do not have data in our tables. We can fill our database with some data as following. Basically, we create two tables: 

Departments with Code, Name, and Budget columns 
Employees with SSN, Name, LastName, and Department columns.

In [ ]:
# Inserting data to Departments table
conn.execute("INSERT INTO Departments(Code,Name,Budget) VALUES(14,'IT',65000);")
conn.execute("INSERT INTO Departments(Code,Name,Budget) VALUES(37,'Accounting',15000);")
conn.execute("INSERT INTO Departments(Code,Name,Budget) VALUES(59,'Human Resources',240000);")
conn.execute("INSERT INTO Departments(Code,Name,Budget) VALUES(77,'Research',55000);")

# Inserting data to Employees table
conn.execute("INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('123234877','Michael','Rogers',14);")
conn.execute("INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('152934485','Anand','Manikutty',14);")
conn.execute(" INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('222364883','Carol','Smith',37); ")
conn.execute(" INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('326587417','Joe','Stevens',37); ")
conn.execute(" INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('332154719','Mary-Anne','Foster',14);")
conn.execute(" INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('332569843','George','O''Donnell',77);")
conn.execute(" INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('546523478','John','Doe',59);")
conn.execute("INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('631231482','David','Smith',77);")
conn.execute(" INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('654873219','Zacary','Efron',59);")
conn.execute(" INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('745685214','Eric','Goldsmith',59);")
conn.execute(" INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('845657245','Elizabeth','Doe',14);")
conn.execute(" INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('845657246','Kumar','Swamy',14);")
conn.commit()

# Running Queries

In [ ]:
# simple test queries
conn = sqlite3.connect('test.db')
cursor = conn.execute(''' SELECT * FROM Departments ''')
for row in cursor:
  print(row)

(14, 'IT', 65000.0)
(37, 'Accounting', 15000.0)
(59, 'Human Resources', 240000.0)
(77, 'Research', 55000.0)

In [ ]:
cursor = conn.execute(''' SELECT * FROM Employees ''')

for row in cursor:
  print(row)

(123234877, 'Michael', 'Rogers', 14)
(152934485, 'Anand', 'Manikutty', 14)
(222364883, 'Carol', 'Smith', 37)
(326587417, 'Joe', 'Stevens', 37)
(332154719, 'Mary-Anne', 'Foster', 14)
(332569843, 'George', "O'Donnell", 77)
(546523478, 'John', 'Doe', 59)
(631231482, 'David', 'Smith', 77)
(654873219, 'Zacary', 'Efron', 59)
(745685214, 'Eric', 'Goldsmith', 59)
(845657245, 'Elizabeth', 'Doe', 14)
(845657246, 'Kumar', 'Swamy', 14)

In [ ]:
# close the connection
conn.close()

This is the data we will use to highlight important concepts frequently surfacing in the interviews. We will talk more about that soon.